Repository: nicky-dev/zapd
Catalog: apps/merchant/lib/l10n/app_*.arb
Languages: th

# appTitle
source: ZapD Merchant
th: ZapD ร้านค้า

source: Change language
th: เปลี่ยนภาษา

# welcomeTitle
source: ZapD Merchant
th: ZapD ร้านค้า

# welcomeSubtitle
source: Decentralized Food Delivery
th: บริการจัดส่งอาหารแบบกระจายศูนย์

# poweredByNostr
source: Powered by Nostr Protocol
th: ขับเคลื่อนด้วย Nostr Protocol

# nostrDescription
source: Your identity is secured by cryptographic keys. No passwords, no central servers.
th: ข้อมูลของคุณปลอดภัยด้วยกุญแจเข้ารหัส ไม่มีรหัสผ่าน ไม่มีเซิร์ฟเวอร์กลาง

source: New to ZapD?
th: เพิ่งมาใช้ ZapD?

source: Create New Account
th: สร้างบัญชีใหม่

# alreadyHaveKey
source: Already have a Nostr key?
th: มีกุญแจ Nostr อยู่แล้ว?

source: Sign In
th: เข้าสู่ระบบ

# termsAgreement
source: By continuing, you agree to our Terms of Service
th: การดำเนินการต่อถือว่าคุณยอมรับข้อกำหนดการใช้งาน

# generateKeyTitle
source: Generate Your Nostr Key
th: สร้างกุญแจ Nostr ของคุณ

# generateKeyDescription
source: Your Nostr key is your identity on the decentralized network. Keep it safe and never share it with anyone.
th: กุญแจ Nostr คือตัวตนของคุณในเครือข่ายกระจายศูนย์ เก็บรักษาไว้อย่างปลอดภัยและอย่าแชร์ให้ใครเด็ดขาด

source: Generate New Key
th: สร้างกุญแจใหม่

source: Generating...
th: กำลังสร้าง...

# keyGeneratedSuccess
source: Key Generated Successfully!
th: สร้างกุญแจสำเร็จ!

# privateKeySecret
source: Private Key (Keep Secret!)
th: กุญแจส่วนตัว (เก็บเป็นความลับ!)

source: Public Key (Safe to Share)
th: กุญแจสาธารณะ (แชร์ได้)

source: Copy
th: คัดลอก

# copied
source: Copied to clipboard
th: คัดลอกแล้ว

# importantSaveKey
source: Important: Save Your Private Key
th: สำคัญ: เก็บกุญแจส่วนตัวของคุณ

# saveKeyInstructions
source: • Write it down on paper • Store it in a password manager • NEVER share it with anyone • Loss of key = Loss of account
th: • เขียนลงกระดาษ • เก็บในโปรแกรมจัดการรหัสผ่าน • อย่าแชร์ให้ใคร • หากสูญหาย = สูญเสียบัญชี

source: Save and Continue
th: บันทึกและดำเนินการต่อ

source: Saved!
th: บันทึกแล้ว!

source: Generate Different Key
th: สร้างกุญแจใหม่

source: Welcome back! 👋
th: ยินดีต้อนรับกลับมา! 👋

# chooseSignInMethod
source: Choose your preferred sign-in method
th: เลือกวิธีเข้าสู่ระบบที่คุณต้องการ

# privateKeyOrNsec
source: Private Key / nsec
th: กุญแจส่วนตัว / nsec

# privateKeyDescription
source: Direct key input (not recommended for daily use)
th: ใส่กุญแจโดยตรง (ไม่แนะนำสำหรับใช้งานประจำ)

# nostrExtension
source: Nostr Extension (NIP-07)
th: ส่วนขยาย Nostr (NIP-07)

# nostrExtensionDescription
source: Use browser extension for secure signing
th: ใช้ส่วนขยายเบราว์เซอร์เพื่อลงนามอย่างปลอดภัย

# nostrConnectDescription
source: Remote signer or hardware wallet
th: ตัวลงนามระยะไกลหรือกระเป๋าฮาร์ดแวร์

source: SECURE
th: ปลอดภัย

# notRecommended
source: Not Recommended for Regular Use
th: ไม่แนะนำสำหรับการใช้งานประจำ

# enterPrivateKey
source: Enter your 64-character hex key or nsec1...
th: ใส่กุญแจ hex 64 ตัวอักษรหรือ nsec1...

source: Signing In...
th: กำลังเข้าสู่ระบบ...

# connectWithExtension
source: Connect with Nostr Extension
th: เชื่อมต่อด้วยส่วนขยาย Nostr

# extensionDescription
source: This will use your browser extension (NIP-07) for secure key management.
th: จะใช้ส่วนขยายเบราว์เซอร์ (NIP-07) เพื่อจัดการกุญแจอย่างปลอดภัย

source: Supported Extensions:
th: ส่วนขยายที่รองรับ:

source: Connect Extension
th: เชื่อมต่อส่วนขยาย

source: Connecting...
th: กำลังเชื่อมต่อ...

source: Connect with Nostr Connect
th: เชื่อมต่อด้วย Nostr Connect

# nostrConnectFullDescription
source: Use a remote signer or hardware wallet (NIP-46) for maximum security.
th: ใช้ตัวลงนามระยะไกลหรือกระเป๋าฮาร์ดแวร์ (NIP-46) เพื่อความปลอดภัยสูงสุด

source: Bunker URL
th: URL Bunker

source: Connect
th: เชื่อมต่อ

source: Dashboard
th: หน้าหลัก

source: Logout
th: ออกจากระบบ

source: Show
th: แสดง

source: Hide
th: ซ่อน

# noExtensionFound
source: No Nostr extension found! Please install one of these extensions: • nos2x • Alby • Flamingo
th: ไม่พบส่วนขยาย Nostr! กรุณาติดตั้งหนึ่งในส่วนขยายนี้: • nos2x • Alby • Flamingo

# extensionConnected
source: Extension connected successfully!
th: เชื่อมต่อส่วนขยายสำเร็จ!

source: OR
th: หรือ

source: Error saving key
th: เกิดข้อผิดพลาดในการบันทึกกุญแจ

# errorInvalidNsec
source: Invalid nsec format
th: รูปแบบ nsec ไม่ถูกต้อง

# errorPrivateKeyLength
source: Private key must be 64 characters (hex) or start with nsec1
th: กุญแจส่วนตัวต้องมี 64 ตัวอักษร (hex) หรือขึ้นต้นด้วย nsec1

# errorEnterPrivateKey
source: Please enter your private key
th: กรุณาใส่กุญแจส่วนตัวของคุณ

# errorLoginFailed
source: Failed to login
th: เข้าสู่ระบบไม่สำเร็จ

# errorConnectFailed
source: Failed to connect
th: เชื่อมต่อไม่สำเร็จ

# errorEnterBunkerUrl
source: Please enter a Nostr Connect URL
th: กรุณาใส่ URL Nostr Connect

# nostrConnectComingSoon
source: Nostr Connect (NIP-46) coming soon! This will support remote signers and hardware wallets.
th: Nostr Connect (NIP-46) เร็วๆ นี้! จะรองรับตัวลงนามระยะไกลและกระเป๋าฮาร์ดแวร์

# errorInvalidBunkerUrl
source: Invalid bunker URL format. Expected: bunker://pubkey?relay=wss://...
th: รูปแบบ URL bunker ไม่ถูกต้อง ต้องเป็น: bunker://pubkey?relay=wss://...

# nostrConnectConnected
source: Connected to Nostr Connect!
th: เชื่อมต่อ Nostr Connect สำเร็จ!

source: Payment Details
th: รายละเอียดการชำระเงิน

source: Payment Status
th: สถานะการชำระเงิน

# paymentStatusPending
source: Pending
th: รอดำเนินการ

# paymentStatusPaid
source: Paid
th: ชำระแล้ว

# paymentStatusExpired
source: Expired
th: หมดอายุ

# paymentStatusFailed
source: Failed
th: ล้มเหลว

source: Amount
th: จำนวนเงิน

# estimatedSats
source: Estimated
th: ประมาณ

source: Lightning Invoice
th: ใบแจ้งหนี้ Lightning

source: Tap to copy
th: แตะเพื่อคัดลอก

# copiedInvoice
source: Invoice copied to clipboard
th: คัดลอกใบแจ้งหนี้แล้ว

source: Merchant not authenticated
th: ร้านค้ายังไม่ได้เข้าสู่ระบบ

source: Order total not available
th: ยอดคำสั่งซื้อไม่พร้อมใช้งาน

source: Payment ID
th: รหัสการชำระเงิน

source: Order ID
th: รหัสคำสั่งซื้อ

source: Payment Method
th: วิธีการชำระเงิน

# createdAt
source: Created
th: สร้างเมื่อ

source: Paid At
th: ชำระเมื่อ

source: Expires At
th: หมดอายุเมื่อ

source: Show QR Code
th: แสดง QR Code

source: Copy Invoice
th: คัดลอกใบแจ้งหนี้

source: Check Status
th: ตรวจสอบสถานะ

# scanWithWallet
source: Scan with Lightning Wallet
th: สแกนด้วย Lightning Wallet

source: Close
th: ปิด

source: Payment
th: การชำระเงิน

# noPayment
source: No payment yet
th: ยังไม่มีการชำระเงิน

source: Generate Lightning Invoice
th: สร้างใบแจ้งหนี้ Lightning

source: View Details
th: ดูรายละเอียด

source: Notifications
th: การแจ้งเตือน

# markAllAsRead
source: Mark All Read
th: ทำเครื่องหมายอ่านทั้งหมด

source: Clear All
th: ล้างทั้งหมด

source: No notifications
th: ไม่มีการแจ้งเตือน

# clearAllConfirm
source: Are you sure you want to clear all notifications?
th: คุณแน่ใจว่าต้องการล้างการแจ้งเตือนทั้งหมด?

source: Cancel
th: ยกเลิก

source: Notification deleted
th: ลบการแจ้งเตือนแล้ว

source: Undo
th: เลิกทำ

# notificationNewOrder
source: New Order
th: คำสั่งซื้อใหม่

# notificationOrderUpdate
source: Order Update
th: อัปเดตคำสั่งซื้อ

# notificationPayment
source: Payment
th: การชำระเงิน

# notificationSystem
source: System
th: ระบบ

source: Just now
th: เมื่อสักครู่

# minutesAgo
source: {count}m ago
th: {count} นาทีที่แล้ว

# hoursAgo
source: {count}h ago
th: {count} ชั่วโมงที่แล้ว

# daysAgo
source: {count}d ago
th: {count} วันที่แล้ว

source: Analytics
th: วิเคราะห์ยอดขาย

source: Total Revenue
th: รายได้รวม

source: Total Orders
th: คำสั่งซื้อทั้งหมด

source: Average Order Value
th: มูลค่าเฉลี่ยต่อคำสั่งซื้อ

source: Revenue Trend
th: แนวโน้มรายได้

source: Order Status Distribution
th: การกระจายสถานะคำสั่งซื้อ

source: Top Products
th: สินค้าขายดี

source: No data available
th: ไม่มีข้อมูล

# periodToday
source: Today
th: วันนี้

# periodWeek
source: This Week
th: สัปดาห์นี้

# periodMonth
source: This Month
th: เดือนนี้

# periodYear
source: This Year
th: ปีนี้

source: Sold: {count}
th: ขายแล้ว: {count}

source: Orders
th: คำสั่งซื้อ

source: Select Period
th: เลือกช่วงเวลา

# manageYourBusiness
source: Manage your stalls, products, and orders
th: จัดการร้านค้า สินค้า และคำสั่งซื้อของคุณ

source: Pending Orders
th: คำสั่งซื้อที่รอดำเนินการ

source: Active Orders
th: คำสั่งซื้อที่กำลังดำเนินการ

source: Quick Actions
th: เมนูด่วน

source: My Stalls
th: ร้านค้าของฉัน

# manageStalls
source: Manage your food stalls
th: จัดการร้านค้าอาหารของคุณ

source: My Orders
th: คำสั่งซื้อของฉัน

# viewAndManageOrders
source: View and manage customer orders
th: ดูและจัดการคำสั่งซื้อของลูกค้า

source: Settings
th: ตั้งค่า

# configureApp
source: Configure app preferences
th: ตั้งค่าแอพพลิเคชัน

source: Account
th: บัญชี

source: Not available
th: ไม่มีข้อมูล

source: Connection Status
th: สถานะการเชื่อมต่อ

source: Total
th: ทั้งหมด

source: Connected
th: เชื่อมต่อแล้ว

source: Healthy
th: ปกติ

source: Relay List
th: รายการ Relay

# relaysConfigured
source: {count} relays configured
th: ตั้งค่า {count} relays แล้ว

source: Media Server
th: เซิร์ฟเวอร์สื่อ

# legacyTag
source: Legacy
th: รุ่นเก่า

source: About
th: เกี่ยวกับ

source: Version
th: เวอร์ชัน

source: Protocol
th: โปรโตคอล

source: Encryption
th: การเข้ารหัส

source: Danger Zone
th: โซนอันตราย

source: Export Private Key
th: ส่งออก Private Key

# backupPrivateKey
source: Backup your private key
th: สำรองข้อมูล private key ของคุณ

# signOutAccount
source: Sign out from your account
th: ออกจากบัญชีของคุณ

# errorLoadingSettings
source: Error loading settings: {error}
th: เกิดข้อผิดพลาดในการโหลดการตั้งค่า: {error}

# copiedToClipboard
source: {label} copied to clipboard
th: คัดลอก {label} ไปยังคลิปบอร์ดแล้ว

source: No stalls yet
th: ยังไม่มีร้านค้า

# createFirstStall
source: Create your first stall to get started
th: สร้างร้านค้าแรกของคุณเพื่อเริ่มต้น

source: Error
th: ข้อผิดพลาด

source: Retry
th: ลองอีกครั้ง

source: New Stall
th: ร้านค้าใหม่

source: Choose Stall Type
th: เลือกประเภทร้านค้า

source: Filter by status
th: กรองตามสถานะ

source: All Orders
th: คำสั่งซื้อทั้งหมด

source: All
th: ทั้งหมด

source: No orders yet
th: ยังไม่มีคำสั่งซื้อ

# ordersWillAppear
source: Orders from customers will appear here
th: คำสั่งซื้อจากลูกค้าจะปรากฏที่นี่

source: Refresh
th: รีเฟรช

source: Products
th: สินค้า

source: No products yet
th: ยังไม่มีสินค้า

# addFirstProduct
source: Add your first product to start selling
th: เพิ่มสินค้าแรกของคุณเพื่อเริ่มขาย

source: Add Product
th: เพิ่มสินค้า

source: Failed to load products
th: โหลดสินค้าไม่สำเร็จ

source: Edit Product
th: แก้ไขสินค้า

source: Delete Product
th: ลบสินค้า

source: Create Stall
th: สร้างร้านค้า

source: Edit Stall
th: แก้ไขร้านค้า

source: Stall Name
th: ชื่อร้านค้า

source: Description
th: คำอธิบาย

source: Currency
th: สกุลเงิน

source: Cuisine
th: ประเภทอาหาร

source: Preparation Time
th: เวลาเตรียม

source: Operating Hours
th: เวลาเปิด-ปิด

source: Accepts Orders
th: รับคำสั่งซื้อ

source: Shipping Zones
th: โซนการจัดส่ง

source: Add Shipping Zone
th: เพิ่มโซนการจัดส่ง

source: Save
th: บันทึก

source: Delete
th: ลบ

source: Confirm
th: ยืนยัน

source: Product Name
th: ชื่อสินค้า

source: Price
th: ราคา

source: Category
th: หมวดหมู่

source: In Stock
th: มีสินค้า

source: Images
th: รูปภาพ

source: Add Image
th: เพิ่มรูปภาพ

source: Basic Information
th: ข้อมูลพื้นฐาน

# stallNameRequired
source: Stall Name *
th: ชื่อร้านค้า *

# stallNameHint
source: e.g., Thai Street Food
th: เช่น ร้านอาหารไทย

source: Description (optional)
th: คำอธิบาย (ไม่จำเป็น)

source: Please enter stall name
th: กรุณากรอกชื่อแผง

source: Stall created successfully
th: สร้างร้านค้าสำเร็จ

source: Stall updated successfully
th: อัปเดตร้านค้าสำเร็จ

# pleaseAddShippingZone
source: Please add at least one shipping zone
th: กรุณาเพิ่มโซนการจัดส่งอย่างน้อย 1 โซน

# acceptsOrdersDescription
source: Allow customers to place orders
th: อนุญาตให้ลูกค้าสั่งซื้อสินค้า

source: Order Details
th: รายละเอียดคำสั่งซื้อ

# orderLabel
source: Order
th: คำสั่งซื้อ

source: Unknown Stall
th: ไม่มีชื่อร้าน

# readyPrefix
source: Ready:
th: พร้อม:

source: Reject
th: ปฏิเสธ

source: Accept
th: รับคำสั่งซื้อ

source: Start Preparing
th: เริ่มเตรียมอาหาร

source: Mark as Ready
th: มารับสินค้าได้แล้ว

source: Assign Rider
th: มอบหมายผู้ส่ง

source: Private key not available
th: กุญแจส่วนตัวไม่พร้อมใช้งาน

source: Order accepted
th: ยอมรับคำสั่งซื้อแล้ว

source: Order rejected
th: ปฏิเสธคำสั่งซื้อแล้ว

# orderBeingPrepared
source: Order is being prepared
th: กำลังเตรียมคำสั่งซื้อ

# orderReadyForPickup
source: Order is ready for pickup
th: คำสั่งซื้อพร้อมสำหรับรับสินค้าแล้ว

# rejectOrderTitle
source: Reject Order
th: ปฏิเสธคำสั่งซื้อ

# rejectOrderConfirm
source: Are you sure you want to reject this order?
th: คุณแน่ใจหรือไม่ว่าต้องการปฏิเสธคำสั่งซื้อนี้?

source: Rider assignment - Coming soon...
th: การมอบหมายผู้ส่ง - มาในเร็วๆ นี้...

source: Decrypting order details...
th: กำลังถอดรหัสรายละเอียดคำสั่งซื้อ...

source: Decrypt Details
th: ถอดรหัสรายละเอียด

# orderDetailsEncrypted
source: Order details are encrypted
th: รายละเอียดคำสั่งซื้อถูกเข้ารหัส

source: Customer Information
th: ข้อมูลลูกค้า

source: Update Order Status
th: อัปเดตสถานะคำสั่งซื้อ

source: Copy Order ID
th: คัดลอก Order ID

source: Copy Customer Pubkey
th: คัดลอก Customer Pubkey

source: Status
th: สถานะ

source: Customer
th: ลูกค้า

source: Order Items
th: รายการสินค้า

source: Delivery Address
th: ที่อยู่จัดส่ง

source: Contact Phone
th: เบอร์โทรติดต่อ

source: Special Instructions
th: คำสั่งพิเศษ

source: None
th: ไม่มี

source: Actions
th: การดำเนินการ

source: Accept Order
th: รับคำสั่งซื้อ

source: Prepare Order
th: เตรียมคำสั่งซื้อ

source: Ready for Pickup
th: พร้อมรับสินค้า

source: Complete Order
th: คำสั่งซื้อเสร็จสมบูรณ์

source: Cancel Order
th: ยกเลิกคำสั่งซื้อ

source: Loading...
th: กำลังโหลด...

source: Authentication required
th: ต้องเข้าสู่ระบบ

source: Failed to decrypt order details
th: ถอดรหัสรายละเอียดคำสั่งซื้อไม่สำเร็จ

# nameLabel
source: Name
th: ชื่อ

# nostrPubkeyLabel
source: Nostr Pubkey
th: คีย์สาธารณะ Nostr

# phoneLabel
source: Phone
th: โทรศัพท์

# emailLabel
source: Email
th: อีเมล

# addressLabel
source: Address
th: ที่อยู่

# messageLabel
source: Message:
th: ข้อความ:

source: Subtotal
th: รวมย่อย

source: Shipping
th: ค่าจัดส่ง

source: Discount
th: ส่วนลด

# totalLabel
source: Total
th: รวมทั้งหมด

# paymentHashLabel
source: Payment Hash
th: รหัสการชำระเงิน (Hash)

# paymentProofLabel
source: Payment Proof
th: หลักฐานการชำระเงิน

# updatedLabel
source: Updated
th: อัปเดต

# estimatedReadyLabel
source: Estimated Ready
th: คาดว่าจะพร้อม

source: Updating order status...
th: กำลังอัปเดตสถานะคำสั่งซื้อ...

# orderStatusUpdated
source: Order status updated to {status}
th: สถานะคำสั่งซื้อเปลี่ยนเป็น {status}

# failedToUpdateStatus
source: Failed to update status: {error}
th: ไม่สามารถอัปเดตสถานะ: {error}

# actionCannotBeUndone
source: This action cannot be undone.
th: การกระทำนี้ไม่สามารถย้อนกลับได้

# notificationOrderTapped
source: Order {orderId}
th: คำสั่งซื้อ {orderId}

source: Coming soon...
th: เร็วๆ นี้...

# stallDuplicatedSuccess
source: Stall duplicated successfully
th: คัดลอกแผงขายสำเร็จ

source: Stall deleted
th: ลบแผงขายเรียบร้อยแล้ว

# deleteStallTitle
source: Delete Stall
th: ลบแผงขาย

# deleteStallConfirm
source: Are you sure you want to delete "{stallName}"?
th: คุณแน่ใจหรือว่าต้องการลบ "{stallName}"?

source: Open
th: เปิด

source: Closed
th: ปิด

source: Edit
th: แก้ไข

source: Duplicate
th: คัดลอก

# importAndContinue
source: Import & Continue
th: นำเข้า & ดำเนินการต่อ

# pleaseEnterPrivateKey
source: Please enter a private key
th: กรุณากรอกกุญแจส่วนตัว

# analyticsSubtitle
source: View sales and performance metrics
th: ดูยอดขายและตัวชี้วัดการทำงาน

source: Account Information
th: ข้อมูลบัญชี

source: Nostr Authentication
th: การยืนยันด้วย Nostr

source: Shop
th: ร้านค้า

# receiptsTitle
source: Receipts
th: ใบเสร็จ

# receiptsView
source: View
th: ดู

# receiptsCopyId
source: Copy ID
th: คัดลอกรหัส

# receiptsAmountPrefix
source: Amount:
th: จำนวน:

# receiptDetailTitle
source: Receipt: {id}
th: ใบเสร็จ: {id}

# receiptLabelTitle
source: Title
th: หัวข้อ

# receiptLabelDate
source: Date
th: วันที่

# receiptLabelAmount
source: Amount
th: จำนวน

# receiptLabelItems
source: Items
th: รายการ

# receiptCopied
source: Receipt id copied to clipboard
th: คัดลอกรหัสใบเสร็จแล้ว

source: ⏳ Waiting for Approval
th: ⏳ กำลังรอการอนุมัติ

# waitingForApprovalContent
source: Please approve this connection on your nsecBunker or Amber app.
th: กรุณาอนุมัติการเชื่อมต่อในแอป nsecBunker หรือ Amber ของคุณ

# stepsLabel
source: Steps:
th: ขั้นตอน:

# step1
source: 1. Open your nsecBunker/Amber app
th: 1. เปิดแอป nsecBunker/Amber ของคุณ

# step2
source: 2. You should see a connection request
th: 2. ควรจะเห็นคำขอเชื่อมต่อ

# step3
source: 3. Approve the request
th: 3. ยืนยันคำขอ

# deleteProductConfirm
source: Are you sure you want to delete "{productName}"?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ "{productName}"?

source: Product deleted successfully
th: ลบสินค้าสำเร็จ

# failedToDeleteProduct
source: Failed to delete product: {error}
th: ไม่สามารถลบสินค้าได้: {error}

# productCreated
source: Product created successfully
th: สร้างสินค้าสำเร็จ

# productUpdated
source: Product updated successfully
th: อัปเดตสินค้าสำเร็จ

source: Image uploaded successfully
th: อัปโหลดรูปภาพสำเร็จ

# failedToUploadImage
source: Failed to upload image: {error}
th: อัปโหลดรูปภาพไม่สำเร็จ: {error}

source: No images added
th: ยังไม่มีรูปภาพ

source: Uploading...
th: กำลังอัปโหลด...

source: Add Category
th: เพิ่มหมวดหมู่

source: Add Specification
th: เพิ่มสเปค

source: No categories added
th: ยังไม่มีหมวดหมู่

source: No specs added
th: ยังไม่มีสเปค

source: Add Shipping Override
th: เพิ่มการปรับค่าส่ง

source: No shipping overrides
th: ยังไม่มีการปรับค่าส่ง

# imageUploadServerTitle
source: Image Upload Server
th: เซิร์ฟเวอร์อัปโหลดรูป

# mediaServerSettingsTitle
source: Media Server Settings
th: การตั้งค่าเซิร์ฟเวอร์สื่อ

# selectMediaServerDescription
source: Select a media server for uploading product images:
th: เลือกเซิร์ฟเวอร์สื่อสำหรับการอัปโหลดรูปภาพสินค้า:

# mediaServerChangedTo
source: Media server changed to {name}
th: เปลี่ยนเซิร์ฟเวอร์สื่อเป็น {name}

# customServerTitle
source: Custom Server
th: เซิร์ฟเวอร์กำหนดเอง

source: Copy nsec
th: คัดลอก nsec

# pleaseFillAllFields
source: Please fill in all fields
th: กรุณากรอกข้อมูลให้ครบ

source: Invalid URL format
th: รูปแบบ URL ไม่ถูกต้อง

# logoutConfirm
source: Are you sure you want to logout?
th: คุณแน่ใจว่าต้องการออกจากระบบหรือไม่?

# debugRunnerLabel
source: Debug runner - minimal app
th: โหมดดีบัก - แอปอย่างง่าย

# zoneLabel
source: Zone: {id}
th: โซน: {id}

# descriptionLabel
source: Description
th: คำอธิบาย

# descriptionHint
source: Describe your stall, menu, or policies
th: อธิบายแผง, เมนู หรือ นโยบายของคุณ

# stallTypeLabel
source: Stall Type
th: ประเภทแผง

# currencyLabel
source: Currency
th: สกุลเงิน

# currencyHint
source: e.g., THB
th: เช่น THB

# prepTimeLabel
source: Preparation Time (mins)
th: เวลาการเตรียม (นาที)

# foodDetailsLabel
source: Food Details
th: รายละเอียดอาหาร

# cuisineTypeLabel
source: Cuisine
th: ประเภทอาหาร

# cuisineHint
source: e.g., Thai, Italian
th: เช่น ไทย, อิตาเลียน

# operatingHoursLabel
source: Operating Hours
th: เวลาทำการ

# operatingHoursHint
source: e.g., 09:00-22:00
th: เช่น 09:00-22:00

# shippingZonesLabel
source: Shipping Zones
th: โซนการจัดส่ง

# shippingZonesDescription
source: Define delivery zones and costs
th: กำหนดโซนการจัดส่งและค่าจัดส่ง

# costLabel
source: Cost
th: ค่าใช้จ่าย

# regionsLabel
source: Regions
th: ภูมิภาค

source: All regions
th: ทุกภูมิภาค

source: Update Stall
th: อัปเดตแผง

# extraCostLabel
source: Extra cost: {cost}
th: ค่าเพิ่ม: {cost}

source: Available for Order
th: พร้อมให้สั่งซื้อ

# availableForOrderSubtitle
source: Customers can order this product
th: ลูกค้าสามารถสั่งสินค้านี้ได้

source: Create Product
th: สร้างสินค้า

source: Product Images
th: รูปภาพสินค้า

# uploadImagesDescription
source: Upload images to showcase your product
th: อัปโหลดรูปภาพเพื่อแสดงสินค้า

source: Categories
th: หมวดหมู่

source: Availability
th: ความพร้อมขาย

source: Edit Specification
th: แก้ไขสเปค

source: Edit Shipping Override
th: แก้ไขการปรับค่าส่ง

source: Add
th: เพิ่ม

source: Category Name
th: ชื่อหมวดหมู่

# categoryHint
source: e.g., Main Course, Dessert
th: เช่น เมนูหลัก, ของหวาน

# privateKeyHexHint
source: Enter your 64-character private key
th: กรอกคีย์ส่วนตัว 64 ตัวอักษร

# serverNameLabel
source: Server Name
th: ชื่อเซิร์ฟเวอร์

# serverNameHint
source: e.g., My Server
th: เช่น My Server

# uploadUrlLabel
source: Upload URL
th: URL อัปโหลด

source: Edit Shipping Zone
th: แก้ไขโซนการจัดส่ง

# zoneIdLabel
source: Zone ID *
th: รหัสโซน *

# zoneNameLabel
source: Zone Name
th: ชื่อโซน

# zoneNameHint
source: e.g., Local Delivery, Express
th: เช่น Local Delivery, Express

# shippingCostLabel
source: Shipping Cost *
th: ค่าจัดส่ง *

# regionsHelper
source: Comma-separated list (optional)
th: คั่นด้วยคอมม่า (ไม่บังคับ)

source: No shipping zones added
th: ยังไม่มีโซนการจัดส่ง

# requiredLabel
source: Required
th: จำเป็น

# nostrInfoDescription
source: ZapD uses Nostr protocol for secure, decentralized authentication. Your private key is your identity - keep it safe!
th: ZapD ใช้โปรโตคอล Nostr สำหรับการยืนยันตัวตนที่ปลอดภัยและกระจายศูนย์ คีย์ส่วนตัวของคุณคือตัวตนของคุณ - เก็บให้ปลอดภัย!

# neverSharePrivateKeyWarning
source: Never share your private key. Store it securely. Loss of private key means loss of access!
th: ห้ามแชร์คีย์ส่วนตัวของคุณ เก็บไว้ในที่ปลอดภัย การสูญหายของคีย์หมายถึงการสูญเสียการเข้าถึง!

# productNameLabel
source: Product Name *
th: ชื่อสินค้า *

# productNameHint
source: e.g., Pad Thai
th: เช่น ผัดไทย

source: Please enter product name
th: กรุณากรอกชื่อสินค้า

# priceLabel
source: Price *
th: ราคา *

# invalidLabel
source: Invalid
th: ไม่ถูกต้อง

# quantityHint
source: Leave empty for unlimited
th: ปล่อยว่างสำหรับไม่จำกัด

# spicyLevelLabel
source: Spicy Level (0-5)
th: ระดับความเผ็ด (0-5)

# dailyLimitLabel
source: Daily Limit
th: จำกัดต่อวัน

# dailyLimitHint
source: Max orders per day
th: จำนวนสั่งสูงสุดต่อวัน

# productSpecificationsHeader
source: Product Specifications (NIP-15)
th: สเปคสินค้า (NIP-15)

# specKeyLabel
source: Key *
th: คีย์ *

# specKeyHint
source: e.g., Size, Weight, Material
th: เช่น ขนาด, น้ำหนัก, วัสดุ

# specValueLabel
source: Value *
th: ค่า *

# specValueHint
source: e.g., Large, 500g, Cotton
th: เช่น ใหญ่, 500g, ผ้า

# shippingCostsHeader
source: Shipping Costs (NIP-15)
th: ค่าจัดส่ง (NIP-15)

# extraShippingCostsDescription
source: Extra shipping costs per zone
th: ค่าใช้จ่ายการจัดส่งเพิ่มเติมต่อโซน

# quantityLabel
source: Quantity
th: จำนวน

source: Change server
th: เปลี่ยนเซิร์ฟเวอร์

# errorWithMessage
source: Error: {message}
th: ข้อผิดพลาด: {message}

# nostrConnectConnectedWithKey
source: {message} Public key: {pubkey}
th: {message} คีย์สาธารณะ: {pubkey}
